{
  "dayToDay" : [
    {
      "type": "day-to-day",
      "question": "Which decision-making model should be deployed?",
      "id": "D3",
      "order": 1,
      "median": 5,
      "mode": 5,
      "mean": 4.133,
      "info": "Think about how decisions should be made in your project. Do you plan to make decisions on your own? Or maybe counting on the support of some kind of commitee? This question is one of the most important day-to-day issues you have to face regarding governance.",
      "links" : [
        { "url" : "", "description" : ""}
      ]
    },
    {
      "type": "day-to-day",
      "question": "How to set the governing “body”? And what is it?",
      "id": "D2",
      "order": 2,
      "median": 4,
      "mode": 5,
      "mean": 3.8,
      "info": "The term “governing body” may be scary, but the point is to think about who concentrates the decision-making power and the support needed. Do you visualize it as a light-weight or maybe you need some organizational support?",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Who should define the decision-making model?",
      "id": "D4",
      "order": 3,
      "median": 4,
      "mode": 5,
      "mean": 3.533,
      "info": "This question makes you think about the actors in charge of creating (or evolving) the governance model. It may also trigger some discussion about how to do it.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Who can have some influence on the way the project is developed?",
      "id": "D11",
      "order": 4,
      "median": 4,
      "mode": 4,
      "mean": 3.467,
      "info": "This question specifically refers to those situations where collaborators want to have some impact in the way your project is developed. Think about both project developers and external contributors, can anyone have a word on the way the project is governed?",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Who makes the decision of accepting a pull request? How much time does it take?",
      "id": "D13",
      "order": 5,
      "median": 4,
      "mode": 5,
      "mean": 3.533,
      "info": "Think about the situation: your project receives a pull request from an external collaborator. Who will review it, and accept it? Do you have some time framing policy for treating pull requests?",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Who is the owner of the assets (i.e,. domain, GitHub, CI/CD, etc.)?",
      "id": "D18",
      "order": 6,
      "median": 4,
      "mode": 5,
      "mean": 3.733,
      "info": "The ownership is always an important topic to consider. Think whether you want to identify leaders (or owners) for your artefacts? This will also help to think about a license to choose.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Which methods should be deployed for conflict resolution?",
      "id": "D21",
      "order": 7,
      "median": 4,
      "mode": 4,
      "mean": 3.733,
      "info": "Problems eventually appear, and it is crucial to have some plan to solve them. A code of conduct is useful to address this issue.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Which organization structure is the most appropriate?",
      "id": "D1",
      "order": 8,
      "median": 3,
      "mode": 3,
      "mean": 3.6,
      "info": "Even though you are only a group of eager developers, you should also think whether you plan to aim at some kind of organization structure. For instance, there is a high number of Open Source projects that end up creating a foundation.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "What about funding? How to address it?",
      "id": "D5",
      "order": 9,
      "median": 3,
      "mode": 3,
      "mean": 3.333,
      "info": "Open Source development does not have to be free work. You should look for potential funding solutions.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "How to deal with membership?",
      "id": "D6",
      "order": 10,
      "median": 3,
      "mode": 2,
      "mean": 2.867,
      "info": "",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Which license should be applied?",
      "id": "D8",
      "order": 11,
      "median": 3,
      "mode": 3,
      "mean": 2.867,
      "info": "Licensing is always a hard topic to treat. At the beginning, it may be easy to think about GPL, EPL or CC terms, but you should carefully read the differences and decide what is the most suitable.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "How to help with the vision of the project?",
      "id": "D9",
      "order": 12,
      "median": 3,
      "mode": 3,
      "mean": 3.2,
      "info": "Do you foresee some mechanism to gather feedback about the project development? Maybe you think about one developer leading the development process but do you visualize some help from the community?",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Who decides if my contribution will be included in the next release?",
      "id": "D14",
      "order": 13,
      "median": 3,
      "mode": 5,
      "mean": 3.4,
      "info": "This is a very specific question and will help you identify one of the main decision-makers in your project (either a developer, a group of developers, or a commitee).",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "How to deal with accountability?",
      "id": "D15",
      "order": 14,
      "median": 3,
      "mode": 2,
      "mean": 3.133,
      "info": "Accountability may sound scary, but it just refers to having a way to trace back the contributions of your project. It can later help you recognize the development effort and the main actors in your project.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "Is there any kind of communication plan?",
      "id": "D16",
      "order": 15,
      "median": 3,
      "mode": 4,
      "mean": 2.933,
      "info": "Working hard on defining a good governance model is nice, but promoting it and make it accesible is even better.",
      "links" : []
    },
    {
      "type": "day-to-day",
      "question": "How to promote onboarding to the governance?",
      "id": "D17",
      "order": 16,
      "median": 3,
      "mode": 3,
      "mean": 3.267,
      "info": "Onboarding refers to the ability of the project to absorb new contributors to help on the development process.",
      "links" : []
    }
  ],
  "barriersAndNeeds" : [
    {
      "type": "barriers-needs",
      "question": "Is you governance model easy to access?",
      "id": "B2",
      "order": 1,
      "median": 4,
      "mode": 5,
      "mean": 3.6,
      "info": "Think how difficult if for newcomers to understand how your project is governed. For instance, how hard is for newcomers to discover who is behind the project leadership?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you considered the organic growth of your project?",
      "id": "B8",
      "order": 2,
      "median": 4,
      "mode": 4,
      "mean": 3.4,
      "info": "As any other project under development, your project will evolve along time. Have you planned how to deal with that in terms of decision-making mechanisms?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Be aware of burnout consequences",
      "id": "B9",
      "order": 3,
      "median": 4,
      "mode": 4,
      "mean": 3.733,
      "info": "Take care of your contributors, they may feel they are working too much in your project. Paying attention to the health of your community is crucial.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you identified the scope of your community?",
      "id": "B11",
      "order": 4,
      "median": 4,
      "mode": 3,
      "mean": 3.667,
      "info": "The community of any Open Source project can have different faces, are they developers with a strong technical background? or maybe are they end-users? It is important to know yous community and their limits.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you studied whether there is a single point of failure in your project",
      "id": "B15",
      "order": 5,
      "median": 4,
      "mode": 3,
      "mean": 3.6,
      "info": "This is an important task to do: try to discover if your project can fail due to a single elements (i.e., component, developer, etc.).",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Is the money (and funding) a problem?",
      "id": "B17",
      "order": 6,
      "median": 4,
      "mode": 4,
      "mean": 3.8,
      "info": "Sometimes Open Source projects are having problems due to economical issues, try to prevent them by analyzing the main source expenses.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you experienced previous problems with governance or community processes?",
      "id": "B22",
      "order": 7,
      "median": 4,
      "mode": 4,
      "mean": 3.267,
      "info": "Maybe you have experience in dealing with governance issues, in that case, have you identified the main reason of that problem? how would you prevent it?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Could the license become a problem?",
      "id": "B1",
      "order": 8,
      "median": 3,
      "mode": 4,
      "mean": 3,
      "info": "License problems usually appear when the decision to adopt one was not carefully made. To avoid this barrier, try to think in advance if it may become a problem in the future.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "May the security/maturity process be a problem?",
      "id": "B3",
      "order": 9,
      "median": 3,
      "mode": 3,
      "mean": 3.133,
      "info": "Security/maturity issues may become a problem in Open Source projects oriented to specific fields, such as enterprise applications or critical systems.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you clarified the elements to be governed?",
      "id": "B4",
      "order": 10,
      "median": 3,
      "mode": 3,
      "mean": 3.333,
      "info": "It is important to clearly identify the elements of your projects that are under control of the governance model. For instance, issues or pull requests are usually governed in some way.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you studied the impact of governance in your project?",
      "id": "B5",
      "order": 11,
      "median": 3,
      "mode": 4,
      "mean": 3.333,
      "info": "Deploying or changing a governance model may have an important impact in your project. You should study who (and what) will be affected by the changes and think how to prevent possible conflicts.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Does you project development process involve some safety concerns?",
      "id": "B6",
      "order": 12,
      "median": 3,
      "mode": 2,
      "mean": 2.867,
      "info": "Safety regulations are generally very strict and requires compliance levels that may affect the governance of your project. ",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Is it easy to identify contributions to governance?",
      "id": "B7",
      "order": 13,
      "median": 3,
      "mode": 3,
      "mean": 3.067,
      "info": "This barrier appears when it is not clear how to contribute to the governance model of your project. Do you foresee the possibility of allowing anyone to contribute?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you explored possible considerations in human-centric processes?",
      "id": "B10",
      "order": 14,
      "median": 3,
      "mode": 3,
      "mean": 3.4,
      "info": "Alghouth human-centric concepts may seem abstract, it refers to the fact that Open Source project usually capitalize on contributors (beyond economical or organizational entitites).",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Is the transparency and lived experience balanced?",
      "id": "B12",
      "order": 15,
      "median": 3,
      "mode": 3,
      "mean": 3.2,
      "info": "This barrier refers to a proper acknowledgement of the experience of the contributors of your project, and how easy it is to check it.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Open source versus open governance",
      "id": "B13",
      "order": 16,
      "median": 3,
      "mode": 3,
      "mean": 3.2,
      "info": "Openness can refer to multiple elements in your project. Have you thought whether you want to embrace the Open Source movement and how it may involve opening the governance model of your project?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you defined a proper communication methodology?",
      "id": "B14",
      "order": 17,
      "median": 3,
      "mode": 4,
      "mean": 3.4,
      "info": "Efficient communication means will assure better transparency and openness in your project.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you identified possible problematic governance models (e.g., BDFL)?",
      "id": "B18",
      "order": 18,
      "median": 3,
      "mode": 4,
      "mean": 3.067,
      "info": "Sometimes the best way to identify the best governance model is to first study those ones that you know are bad for your project.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Is there a strong cult of personality in your project?",
      "id": "B19",
      "order": 19,
      "median": 3,
      "mode": 4,
      "mean": 3.333,
      "info": "Sometimes projects awards those contributors with strong presence in the community, is your project one of them?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Is there any kind of ownership operations?",
      "id": "B20",
      "order": 20,
      "median": 3,
      "mode": 3,
      "mean": 3.4,
      "info": "Think if your project keeps some kind of ownership record or if some ownership permission has to be made.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you identify a power disparity in your project community?",
      "id": "B21",
      "order": 21,
      "median": 3,
      "mode": 4,
      "mean": 3.2,
      "info": "Is your project some kind of two-headed dragon with different leaders? Who has the control of the community?",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Are you transitioning between governance models?",
      "id": "B23",
      "order": 22,
      "median": 3,
      "mode": 3,
      "mean": 3,
      "info": "The change of governance models usually becomes disruptive in any project, try to identify potential issues that may appear.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Could bad press affect your project?",
      "id": "B16",
      "order": 23,
      "median": 2,
      "mode": 2,
      "mean": 2.4,
      "info": "If your project is well-known, bad press could be an issue, try to identify counter plans to face the situation.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Are patents (both internal and external to your project) a problem?",
      "id": "B24",
      "order": 24,
      "median": 2,
      "mode": 1,
      "mean": 1.933,
      "info": "Some projects rely on existing patents to work, in these cases, it is important to clearly understand the legal implications and how it affects the evolution of your project.",
      "links" : []
    },
    {
      "type": "barriers-needs",
      "question": "Have you considered remote versus in-person workers",
      "id": "B25",
      "order": 25,
      "median": 1,
      "mode": 1,
      "mean": 2.133,
      "info": "Even though software development could be seen as one of the sectors where remote working is welcome, it sometime bacome an isuee.",
      "links" : []
    }
  ],
  "interventions" : [
    {
      "type": "interventions",
      "question": "Have you considered removing those bad actors?",
      "id": "I1",
      "order": 1,
      "median": 5,
      "mode": 5,
      "mean": 4.467,
      "info": "Sometimes the best solution is to isolate or remove the contributors that are causing problems.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Why not making make a pause, trying to give some space/time to fix the problem?",
      "id": "I2",
      "order": 2,
      "median": 4,
      "mode": 5,
      "mean": 4.067,
      "info": "Sometimes time is the best solution, think whether some time (or space) could make the problem disappear.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Have you tried to descaling or breaking down the problem?",
      "id": "I5",
      "order": 3,
      "median": 4,
      "mode": 4,
      "mean": 3.6,
      "info": "Being proactive is maybe the best way to fix the problem, analyze and face the situation to really understand how to solve it!",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Sometimes the problem is in the implicit unknown, why not document it and make it explicit?",
      "id": "I9",
      "order": 4,
      "median": 4,
      "mode": 3,
      "mean": 3.733,
      "info": "Sometimes we oversee the actual source of the problem, which may be related with implicit information in your project.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Other possible resort: Ask for (external) help!",
      "id": "I10",
      "order": 5,
      "median": 4,
      "mode": 4,
      "mean": 4,
      "info": "If you and your community cannot solve the problem, search for help, sometimes is the best way to have a different view of the problem.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Why not forking the project?",
      "id": "I3",
      "order": 6,
      "median": 3,
      "mode": 4,
      "mean": 3.067,
      "info": "The decision of forking a project is maybe one of the most aggressive ones but sometimes is the only solution.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Could a decentralization solve the problem?",
      "id": "I4",
      "order": 7,
      "median": 3,
      "mode": 4,
      "mean": 3.2,
      "info": "Sometimes the problem is the accumulation of power in specific parts of the project (e.g., the leader, an important component of the software, etc.). Think if you can split it.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Have you thought to change to a federation as project organization?",
      "id": "I7",
      "order": 8,
      "median": 3,
      "mode": 3,
      "mean": 2.8,
      "info": "Organizational changes such as evolving to a federation (or other kind of structure) could help you to face the problem.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Remember to work on gaps that you are identified as problem sources",
      "id": "I8",
      "order": 9,
      "median": 3,
      "mode": 3,
      "mean": 3.467,
      "info": "We recommended you to make an effort to identify the implicit elements of your project, try to recover those notes and see if they can help",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Go to the point: change the governance model",
      "id": "I11",
      "order": 10,
      "median": 3,
      "mode": 3,
      "mean": 3.267,
      "info": "Sometimes the only solution is to change the governance model. But we aware, it is going to be disruptive.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Could an incentive mechanism address the problem?",
      "id": "I13",
      "order": 11,
      "median": 3,
      "mode": 3,
      "mean": 3.267,
      "info": "Incentive mechanisms could help you to address governance issues in your project, for instance, to give some recognition to those external contributors who are fixing important bugs in your project.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Have you conducted a risk assessment to identify the problem?",
      "id": "I14",
      "order": 12,
      "median": 3,
      "mode": 4,
      "mean": 3.267,
      "info": "Full risk assessment may look scary but it is important, at least, explore the potential sources of risk of the problem.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Should you move back to an incubation state?",
      "id": "I15",
      "order": 13,
      "median": 3,
      "mode": 1,
      "mean": 2.6,
      "info": "Consider moving to a different development status, for instance, to an incubation status.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "This may be dractic: have you thought about dissolving the project?",
      "id": "I6",
      "order": 14,
      "median": 2,
      "mode": 1,
      "mean": 2.533,
      "info": "This may be the last resort to consider, but sometime it pays off.",
      "links" : []
    },
    {
      "type": "interventions",
      "question": "Patents are sometimes a source of problems",
      "id": "I12",
      "order": 15,
      "median": 1,
      "mode": 1,
      "mean": 1.8,
      "info": "Have you consider to remove your dependency to patents?",
      "links" : []
    }
  ]
}